{
  "topic": "math-geometry",
  "problems": {
    "2-keys-keyboard": {
      "questionId": "650",
      "title": "2 Keys Keyboard",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 1000"
      ],
      "description": "There is only one character 'A' on the screen of a notepad. You can perform one of two operations on this notepad for each step:\nGiven an integer n, return the minimum number of operations to get the character 'A' exactly n times on the screen.\nExample 1:\nExample 2:\nConstraints:"
    },
    "add-binary": {
      "questionId": "67",
      "title": "Add Binary",
      "difficulty": "Easy",
      "constraints": [
        "1 <= a.length, b.length <= 104",
        "a and b consist only of '0' or '1' characters.",
        "Each string does not contain leading zeros except for the zero itself."
      ],
      "description": "Given two binary strings a and b, return their sum as a binary string.\nExample 1:\nExample 2:\nConstraints:"
    },
    "add-digits": {
      "questionId": "258",
      "title": "Add Digits",
      "difficulty": "Easy",
      "constraints": [
        "0 <= num <= 231 - 1"
      ],
      "description": "Given an integer num, repeatedly add all its digits until the result has only one digit, and return it.\nExample 1:\nExample 2:\nConstraints:\nFollow up: Could you do it without any loop/recursion in O(1) runtime?"
    },
    "add-strings": {
      "questionId": "415",
      "title": "Add Strings",
      "difficulty": "Easy",
      "constraints": [
        "1 <= num1.length, num2.length <= 104",
        "num1 and num2 consist of only digits.",
        "num1 and num2 don't have any leading zeros except for the zero itself."
      ],
      "description": "Given two non-negative integers, num1 and num2 represented as string, return the sum of num1 and num2 as a string.\nYou must solve the problem without using any built-in library for handling large integers (such as BigInteger). You must also not convert the inputs to integers directly.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "add-to-array-form-of-integer": {
      "questionId": "989",
      "title": "Add to Array-Form of Integer",
      "difficulty": "Easy",
      "constraints": [
        "1 <= num.length <= 104",
        "0 <= num[i] <= 9",
        "num does not contain any leading zeros except for the zero itself.",
        "1 <= k <= 104"
      ],
      "description": "The array-form of an integer num is an array representing its digits in left to right order.\nGiven num, the array-form of an integer, and an integer k, return the array-form of the integer num + k.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "arranging-coins": {
      "questionId": "441",
      "title": "Arranging Coins",
      "difficulty": "Easy",
      "constraints": [
        "1 <= n <= 231 - 1"
      ],
      "description": "You have n coins and you want to build a staircase with these coins. The staircase consists of k rows where the ith row has exactly i coins. The last row of the staircase may be incomplete.\nGiven the integer n, return the number of complete rows of the staircase you will build.\nExample 1:\nExample 2:\nConstraints:"
    },
    "base-7": {
      "questionId": "504",
      "title": "Base 7",
      "difficulty": "Easy",
      "constraints": [
        "-107 <= num <= 107"
      ],
      "description": "Given an integer num, return a string of its base 7 representation.\nExample 1:\nExample 2:\nConstraints:"
    },
    "beautiful-arrangement-ii": {
      "questionId": "667",
      "title": "Beautiful Arrangement II",
      "difficulty": "Medium",
      "constraints": [
        "1 <= k < n <= 104"
      ],
      "description": "Given two integers n and k, construct a list answer that contains n different positive integers ranging from 1 to n and obeys the following requirement:\nReturn the list answer. If there multiple valid answers, return any of them.\nExample 1:\nExample 2:\nConstraints:"
    },
    "beautiful-array": {
      "questionId": "932",
      "title": "Beautiful Array",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 1000"
      ],
      "description": "An array nums of length n is beautiful if:\nGiven the integer n, return any beautiful array nums of length n. There will be at least one valid answer for the given n.\nExample 1:\nExample 2:\nConstraints:"
    },
    "broken-calculator": {
      "questionId": "991",
      "title": "Broken Calculator",
      "difficulty": "Medium",
      "constraints": [
        "1 <= startValue, target <= 109"
      ],
      "description": "There is a broken calculator that has the integer startValue on its display initially. In one operation, you can:\nGiven two integers startValue and target, return the minimum number of operations needed to display target on the calculator.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "bulb-switcher": {
      "questionId": "319",
      "title": "Bulb Switcher",
      "difficulty": "Medium",
      "constraints": [
        "0 <= n <= 109"
      ],
      "description": "There are n bulbs that are initially off. You first turn on all the bulbs, then you turn off every second bulb.\nOn the third round, you toggle every third bulb (turning on if it's off or turning off if it's on). For the ith round, you toggle every i bulb. For the nth round, you only toggle the last bulb.\nReturn the number of bulbs that are on after n rounds.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "bulb-switcher-ii": {
      "questionId": "672",
      "title": "Bulb Switcher II",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 1000",
        "0 <= presses <= 1000"
      ],
      "description": "There is a room with n bulbs labeled from 1 to n that all are turned on initially, and four buttons on the wall. Each of the four buttons has a different functionality where:\nYou must make exactly presses button presses in total. For each press, you may pick any of the four buttons to press.\nGiven the two integers n and presses, return the number of different possible statuses after performing all presses button presses.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "can-i-win": {
      "questionId": "464",
      "title": "Can I Win",
      "difficulty": "Medium",
      "constraints": [
        "1 <= maxChoosableInteger <= 20",
        "0 <= desiredTotal <= 300"
      ],
      "description": "In the \"100 game\" two players take turns adding, to a running total, any integer from 1 to 10. The player who first causes the running total to reach or exceed 100 wins.\nWhat if we change the game so that players cannot re-use integers?\nFor example, two players might take turns drawing from a common pool of numbers from 1 to 15 without replacement until they reach a total >= 100.\nGiven two integers maxChoosableInteger and desiredTotal, return true if the first player to move can force a win, otherwise, return false. Assume both players play optimally.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "clumsy-factorial": {
      "questionId": "1006",
      "title": "Clumsy Factorial",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 104"
      ],
      "description": "The factorial of a positive integer n is the product of all positive integers less than or equal to n.\nWe make a clumsy factorial using the integers in decreasing order by swapping out the multiply operations for a fixed rotation of operations with multiply '*', divide '/', add '+', and subtract '-' in this order.\nHowever, these operations are still applied using the usual order of operations of arithmetic. We do all multiplication and division steps before any addition or subtraction steps, and multiplication and division steps are processed left to right.\nAdditionally, the division that we use is floor division such that 10 * 9 / 8 = 90 / 8 = 11.\nGiven an integer n, return the clumsy factorial of n.\nExample 1:\nExample 2:\nConstraints:"
    },
    "complex-number-multiplication": {
      "questionId": "537",
      "title": "Complex Number Multiplication",
      "difficulty": "Medium",
      "constraints": [
        "num1 and num2 are valid complex numbers."
      ],
      "description": "A complex number can be represented as a string on the form \"real+imaginaryi\" where:\nGiven two complex numbers num1 and num2 as strings, return a string of the complex number that represents their multiplications.\nExample 1:\nExample 2:\nConstraints:"
    },
    "construct-the-rectangle": {
      "questionId": "492",
      "title": "Construct the Rectangle",
      "difficulty": "Easy",
      "constraints": [
        "1 <= area <= 107"
      ],
      "description": "A web developer needs to know how to design a web page's size. So, given a specific rectangular web page’s area, your job by now is to design a rectangular web page, whose length L and width W satisfy the following requirements:\nReturn an array [L, W] where L and W are the length and width of the web page you designed in sequence.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "continuous-subarray-sum": {
      "questionId": "523",
      "title": "Continuous Subarray Sum",
      "difficulty": "Medium",
      "constraints": [
        "1 <= nums.length <= 105",
        "0 <= nums[i] <= 109",
        "0 <= sum(nums[i]) <= 231 - 1",
        "1 <= k <= 231 - 1"
      ],
      "description": "Given an integer array nums and an integer k, return true if nums has a good subarray or false otherwise.\nA good subarray is a subarray where:\nNote that:\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "convert-a-number-to-hexadecimal": {
      "questionId": "405",
      "title": "Convert a Number to Hexadecimal",
      "difficulty": "Easy",
      "constraints": [
        "-231 <= num <= 231 - 1"
      ],
      "description": "Given a 32-bit integer num, return a string representing its hexadecimal representation. For negative integers, two’s complement method is used.\nAll the letters in the answer string should be lowercase characters, and there should not be any leading zeros in the answer except for the zero itself.\nNote: You are not allowed to use any built-in library method to directly solve this problem.\nExample 1:\nExample 2:\nConstraints:"
    },
    "convert-to-base-2": {
      "questionId": "1017",
      "title": "Convert to Base -2",
      "difficulty": "Medium",
      "constraints": [
        "0 <= n <= 109"
      ],
      "description": "Given an integer n, return a binary string representing its representation in base -2.\nNote that the returned string should not have leading zeros unless the string is \"0\".\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "count-numbers-with-unique-digits": {
      "questionId": "357",
      "title": "Count Numbers with Unique Digits",
      "difficulty": "Medium",
      "constraints": [
        "0 <= n <= 8"
      ],
      "description": "Given an integer n, return the count of all numbers with unique digits, x, where 0 <= x < 10n.\nExample 1:\nExample 2:\nConstraints:"
    },
    "count-primes": {
      "questionId": "204",
      "title": "Count Primes",
      "difficulty": "Medium",
      "constraints": [
        "0 <= n <= 5 * 106"
      ],
      "description": "Given an integer n, return the number of prime numbers that are strictly less than n.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "different-ways-to-add-parentheses": {
      "questionId": "241",
      "title": "Different Ways to Add Parentheses",
      "difficulty": "Medium",
      "constraints": [
        "1 <= expression.length <= 20",
        "expression consists of digits and the operator '+', '-', and '*'.",
        "All the integer values in the input expression are in the range [0, 99].",
        "The integer values in the input expression do not have a leading '-' or '+' denoting the sign."
      ],
      "description": "Given a string expression of numbers and operators, return all possible results from computing all the different possible ways to group numbers and operators. You may return the answer in any order.\nThe test cases are generated such that the output values fit in a 32-bit integer and the number of different results does not exceed 104.\nExample 1:\nExample 2:\nConstraints:"
    },
    "divide-two-integers": {
      "questionId": "29",
      "title": "Divide Two Integers",
      "difficulty": "Medium",
      "constraints": [
        "-231 <= dividend, divisor <= 231 - 1",
        "divisor != 0"
      ],
      "description": "Given two integers dividend and divisor, divide two integers without using multiplication, division, and mod operator.\nThe integer division should truncate toward zero, which means losing its fractional part. For example, 8.345 would be truncated to 8, and -2.7335 would be truncated to -2.\nReturn the quotient after dividing dividend by divisor.\nNote: Assume we are dealing with an environment that could only store integers within the 32-bit signed integer range: [−231, 231 − 1]. For this problem, if the quotient is strictly greater than 231 - 1, then return 231 - 1, and if the quotient is strictly less than -231, then return -231.\nExample 1:\nExample 2:\nConstraints:"
    },
    "divisor-game": {
      "questionId": "1025",
      "title": "Divisor Game",
      "difficulty": "Easy",
      "constraints": [
        "1 <= n <= 1000"
      ],
      "description": "Alice and Bob take turns playing a game, with Alice starting first.\nInitially, there is a number n on the chalkboard. On each player's turn, that player makes a move consisting of:\nAlso, if a player cannot make a move, they lose the game.\nReturn true if and only if Alice wins the game, assuming both players play optimally.\nExample 1:\nExample 2:\nConstraints:"
    },
    "elimination-game": {
      "questionId": "390",
      "title": "Elimination Game",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 109"
      ],
      "description": "You have a list arr of all integers in the range [1, n] sorted in a strictly increasing order. Apply the following algorithm on arr:\nGiven the integer n, return the last number that remains in arr.\nExample 1:\nExample 2:\nConstraints:"
    },
    "escape-the-ghosts": {
      "questionId": "789",
      "title": "Escape The Ghosts",
      "difficulty": "Medium",
      "constraints": [
        "1 <= ghosts.length <= 100",
        "ghosts[i].length == 2",
        "-104 <= xi, yi <= 104",
        "There can be multiple ghosts in the same location.",
        "target.length == 2",
        "-104 <= xtarget, ytarget <= 104"
      ],
      "description": "You are playing a simplified PAC-MAN game on an infinite 2-D grid. You start at the point [0, 0], and you are given a destination point target = [xtarget, ytarget] that you are trying to get to. There are several ghosts on the map with their starting positions given as a 2D array ghosts, where ghosts[i] = [xi, yi] represents the starting position of the ith ghost. All inputs are integral coordinates.\nEach turn, you and all the ghosts may independently choose to either move 1 unit in any of the four cardinal directions: north, east, south, or west, or stay still. All actions happen simultaneously.\nYou escape if and only if you can reach the target before any ghost reaches you. If you reach any square (including the target) at the same time as a ghost, it does not count as an escape.\nReturn true if it is possible to escape regardless of how the ghosts move, otherwise return false.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "excel-sheet-column-number": {
      "questionId": "171",
      "title": "Excel Sheet Column Number",
      "difficulty": "Easy",
      "constraints": [
        "1 <= columnTitle.length <= 7",
        "columnTitle consists only of uppercase English letters.",
        "columnTitle is in the range [\"A\", \"FXSHRXW\"]."
      ],
      "description": "Given a string columnTitle that represents the column title as appears in an Excel sheet, return its corresponding column number.\nFor example:\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "excel-sheet-column-title": {
      "questionId": "168",
      "title": "Excel Sheet Column Title",
      "difficulty": "Easy",
      "constraints": [
        "1 <= columnNumber <= 231 - 1"
      ],
      "description": "Given an integer columnNumber, return its corresponding column title as it appears in an Excel sheet.\nFor example:\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "factorial-trailing-zeroes": {
      "questionId": "172",
      "title": "Factorial Trailing Zeroes",
      "difficulty": "Medium",
      "constraints": [
        "0 <= n <= 104"
      ],
      "description": "Given an integer n, return the number of trailing zeroes in n!.\nNote that n! = n * (n - 1) * (n - 2) * ... * 3 * 2 * 1.\nExample 1:\nExample 2:\nExample 3:\nConstraints:\nFollow up: Could you write a solution that works in logarithmic time complexity?"
    },
    "fibonacci-number": {
      "questionId": "509",
      "title": "Fibonacci Number",
      "difficulty": "Easy",
      "constraints": [
        "0 <= n <= 30"
      ],
      "description": "The Fibonacci numbers, commonly denoted F(n) form a sequence, called the Fibonacci sequence, such that each number is the sum of the two preceding ones, starting from 0 and 1. That is,\nGiven n, calculate F(n).\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "fizz-buzz": {
      "questionId": "412",
      "title": "Fizz Buzz",
      "difficulty": "Easy",
      "constraints": [
        "1 <= n <= 104"
      ],
      "description": "Given an integer n, return a string array answer (1-indexed) where:\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "fraction-addition-and-subtraction": {
      "questionId": "592",
      "title": "Fraction Addition and Subtraction",
      "difficulty": "Medium",
      "constraints": [
        "The input string only contains '0' to '9', '/', '+' and '-'. So does the output.",
        "Each fraction (input and output) has the format ±numerator/denominator. If the first input fraction or the output is positive, then '+' will be omitted.",
        "The input only contains valid irreducible fractions, where the numerator and denominator of each fraction will always be in the range [1, 10]. If the denominator is 1, it means this fraction is actually an integer in a fraction format defined above.",
        "The number of given fractions will be in the range [1, 10].",
        "The numerator and denominator of the final result are guaranteed to be valid and in the range of 32-bit int."
      ],
      "description": "Given a string expression representing an expression of fraction addition and subtraction, return the calculation result in string format.\nThe final result should be an irreducible fraction. If your final result is an integer, change it to the format of a fraction that has a denominator 1. So in this case, 2 should be converted to 2/1.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "fraction-to-recurring-decimal": {
      "questionId": "166",
      "title": "Fraction to Recurring Decimal",
      "difficulty": "Medium",
      "constraints": [
        "-231 <= numerator, denominator <= 231 - 1",
        "denominator != 0"
      ],
      "description": "Given two integers representing the numerator and denominator of a fraction, return the fraction in string format.\nIf the fractional part is repeating, enclose the repeating part in parentheses.\nIf multiple answers are possible, return any of them.\nIt is guaranteed that the length of the answer string is less than 104 for all the given inputs.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "generate-random-point-in-a-circle": {
      "questionId": "478",
      "title": "Generate Random Point in a Circle",
      "difficulty": "Medium",
      "constraints": [
        "0 < radius <= 108",
        "-107 <= x_center, y_center <= 107",
        "At most 3 * 104 calls will be made to randPoint."
      ],
      "description": "Given the radius and the position of the center of a circle, implement the function randPoint which generates a uniform random point inside the circle.\nImplement the Solution class:\nExample 1:\nConstraints:"
    },
    "global-and-local-inversions": {
      "questionId": "775",
      "title": "Global and Local Inversions",
      "difficulty": "Medium",
      "constraints": [
        "n == nums.length",
        "1 <= n <= 105",
        "0 <= nums[i] < n",
        "All the integers of nums are unique.",
        "nums is a permutation of all the numbers in the range [0, n - 1]."
      ],
      "description": "You are given an integer array nums of length n which represents a permutation of all the integers in the range [0, n - 1].\nThe number of global inversions is the number of the different pairs (i, j) where:\nThe number of local inversions is the number of indices i where:\nReturn true if the number of global inversions is equal to the number of local inversions.\nExample 1:\nExample 2:\nConstraints:"
    },
    "gray-code": {
      "questionId": "89",
      "title": "Gray Code",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 16"
      ],
      "description": "An n-bit gray code sequence is a sequence of 2n integers where:\nGiven an integer n, return any valid n-bit gray code sequence.\nExample 1:\nExample 2:\nConstraints:"
    },
    "guess-number-higher-or-lower-ii": {
      "questionId": "375",
      "title": "Guess Number Higher or Lower II",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 200"
      ],
      "description": "We are playing the Guessing Game. The game will work as follows:\nGiven a particular n, return the minimum amount of money you need to guarantee a win regardless of what number I pick.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "happy-number": {
      "questionId": "202",
      "title": "Happy Number",
      "difficulty": "Easy",
      "constraints": [
        "1 <= n <= 231 - 1"
      ],
      "description": "Write an algorithm to determine if a number n is happy.\nA happy number is a number defined by the following process:\nReturn true if n is a happy number, and false if not.\nExample 1:\nExample 2:\nConstraints:"
    },
    "implement-rand10-using-rand7": {
      "questionId": "470",
      "title": "Implement Rand10() Using Rand7()",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 105"
      ],
      "description": "Given the API rand7() that generates a uniform random integer in the range [1, 7], write a function rand10() that generates a uniform random integer in the range [1, 10]. You can only call the API rand7(), and you shouldn't call any other API. Please do not use a language's built-in random API.\nEach test case will have one internal argument n, the number of times that your implemented function rand10() will be called while testing. Note that this is not an argument passed to rand10().\nExample 1:\nExample 2:\nExample 3:\nConstraints:\nFollow up:"
    },
    "insert-delete-getrandom-o1": {
      "questionId": "380",
      "title": "Insert Delete GetRandom O(1)",
      "difficulty": "Medium",
      "constraints": [
        "-231 <= val <= 231 - 1",
        "At most 2 * 105 calls will be made to insert, remove, and getRandom.",
        "There will be at least one element in the data structure when getRandom is called."
      ],
      "description": "Implement the RandomizedSet class:\nYou must implement the functions of the class such that each function works in average O(1) time complexity.\nExample 1:\nConstraints:"
    },
    "integer-break": {
      "questionId": "343",
      "title": "Integer Break",
      "difficulty": "Medium",
      "constraints": [
        "2 <= n <= 58"
      ],
      "description": "Given an integer n, break it into the sum of k positive integers, where k >= 2, and maximize the product of those integers.\nReturn the maximum product you can get.\nExample 1:\nExample 2:\nConstraints:"
    },
    "integer-to-roman": {
      "questionId": "12",
      "title": "Integer to Roman",
      "difficulty": "Medium",
      "constraints": [
        "1 <= num <= 3999"
      ],
      "description": "Seven different symbols represent Roman numerals with the following values:\nRoman numerals are formed by appending the conversions of decimal place values from highest to lowest. Converting a decimal place value into a Roman numeral has the following rules:\nGiven an integer, convert it to a Roman numeral.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "k-th-symbol-in-grammar": {
      "questionId": "779",
      "title": "K-th Symbol in Grammar",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 30",
        "1 <= k <= 2n - 1"
      ],
      "description": "We build a table of n rows (1-indexed). We start by writing 0 in the 1st row. Now in every subsequent row, we look at the previous row and replace each occurrence of 0 with 01, and each occurrence of 1 with 10.\nGiven two integer n and k, return the kth (1-indexed) symbol in the nth row of a table of n rows.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "largest-divisible-subset": {
      "questionId": "368",
      "title": "Largest Divisible Subset",
      "difficulty": "Medium",
      "constraints": [
        "1 <= nums.length <= 1000",
        "1 <= nums[i] <= 2 * 109",
        "All the integers in nums are unique."
      ],
      "description": "Given a set of distinct positive integers nums, return the largest subset answer such that every pair (answer[i], answer[j]) of elements in this subset satisfies:\nIf there are multiple solutions, return any of them.\nExample 1:\nExample 2:\nConstraints:"
    },
    "largest-perimeter-triangle": {
      "questionId": "976",
      "title": "Largest Perimeter Triangle",
      "difficulty": "Easy",
      "constraints": [
        "3 <= nums.length <= 104",
        "1 <= nums[i] <= 106"
      ],
      "description": "Given an integer array nums, return the largest perimeter of a triangle with a non-zero area, formed from three of these lengths. If it is impossible to form any triangle of a non-zero area, return 0.\nExample 1:\nExample 2:\nConstraints:"
    },
    "largest-triangle-area": {
      "questionId": "812",
      "title": "Largest Triangle Area",
      "difficulty": "Easy",
      "constraints": [
        "3 <= points.length <= 50",
        "-50 <= xi, yi <= 50",
        "All the given points are unique."
      ],
      "description": "Given an array of points on the X-Y plane points where points[i] = [xi, yi], return the area of the largest triangle that can be formed by any three different points. Answers within 10-5 of the actual answer will be accepted.\nExample 1:\nExample 2:\nConstraints:"
    },
    "magic-squares-in-grid": {
      "questionId": "840",
      "title": "Magic Squares In Grid",
      "difficulty": "Medium",
      "constraints": [
        "row == grid.length",
        "col == grid[i].length",
        "1 <= row, col <= 10",
        "0 <= grid[i][j] <= 15"
      ],
      "description": "A 3 x 3 magic square is a 3 x 3 grid filled with distinct numbers from 1 to 9 such that each row, column, and both diagonals all have the same sum.\nGiven a row x col grid of integers, how many 3 x 3 magic square subgrids are there?\nNote: while a magic square can only contain numbers from 1 to 9, grid may contain numbers up to 15.\nExample 1:\nExample 2:\nConstraints:"
    },
    "maximum-product-of-three-numbers": {
      "questionId": "628",
      "title": "Maximum Product of Three Numbers",
      "difficulty": "Easy",
      "constraints": [
        "3 <= nums.length <= 104",
        "-1000 <= nums[i] <= 1000"
      ],
      "description": "Given an integer array nums, find three numbers whose product is maximum and return the maximum product.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "maximum-swap": {
      "questionId": "670",
      "title": "Maximum Swap",
      "difficulty": "Medium",
      "constraints": [
        "0 <= num <= 108"
      ],
      "description": "You are given an integer num. You can swap two digits at most once to get the maximum valued number.\nReturn the maximum valued number you can get.\nExample 1:\nExample 2:\nConstraints:"
    },
    "minimum-area-rectangle": {
      "questionId": "939",
      "title": "Minimum Area Rectangle",
      "difficulty": "Medium",
      "constraints": [
        "1 <= points.length <= 500",
        "points[i].length == 2",
        "0 <= xi, yi <= 4 * 104",
        "All the given points are unique."
      ],
      "description": "You are given an array of points in the X-Y plane points where points[i] = [xi, yi].\nReturn the minimum area of a rectangle formed from these points, with sides parallel to the X and Y axes. If there is not any such rectangle, return 0.\nExample 1:\nExample 2:\nConstraints:"
    },
    "minimum-area-rectangle-ii": {
      "questionId": "963",
      "title": "Minimum Area Rectangle II",
      "difficulty": "Medium",
      "constraints": [
        "1 <= points.length <= 50",
        "points[i].length == 2",
        "0 <= xi, yi <= 4 * 104",
        "All the given points are unique."
      ],
      "description": "You are given an array of points in the X-Y plane points where points[i] = [xi, yi].\nReturn the minimum area of any rectangle formed from these points, with sides not necessarily parallel to the X and Y axes. If there is not any such rectangle, return 0.\nAnswers within 10-5 of the actual answer will be accepted.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "minimum-moves-to-equal-array-elements": {
      "questionId": "453",
      "title": "Minimum Moves to Equal Array Elements",
      "difficulty": "Medium",
      "constraints": [
        "n == nums.length",
        "1 <= nums.length <= 105",
        "-109 <= nums[i] <= 109",
        "The answer is guaranteed to fit in a 32-bit integer."
      ],
      "description": "Given an integer array nums of size n, return the minimum number of moves required to make all array elements equal.\nIn one move, you can increment n - 1 elements of the array by 1.\nExample 1:\nExample 2:\nConstraints:"
    },
    "minimum-moves-to-equal-array-elements-ii": {
      "questionId": "462",
      "title": "Minimum Moves to Equal Array Elements II",
      "difficulty": "Medium",
      "constraints": [
        "n == nums.length",
        "1 <= nums.length <= 105",
        "-109 <= nums[i] <= 109"
      ],
      "description": "Given an integer array nums of size n, return the minimum number of moves required to make all array elements equal.\nIn one move, you can increment or decrement an element of the array by 1.\nTest cases are designed so that the answer will fit in a 32-bit integer.\nExample 1:\nExample 2:\nConstraints:"
    },
    "minimum-time-difference": {
      "questionId": "539",
      "title": "Minimum Time Difference",
      "difficulty": "Medium",
      "constraints": [
        "2 <= timePoints.length <= 2 * 104",
        "timePoints[i] is in the format \"HH:MM\"."
      ],
      "description": "Example 1:\nExample 2:\nConstraints:"
    },
    "mirror-reflection": {
      "questionId": "858",
      "title": "Mirror Reflection",
      "difficulty": "Medium",
      "constraints": [
        "1 <= q <= p <= 1000"
      ],
      "description": "There is a special square room with mirrors on each of the four walls. Except for the southwest corner, there are receptors on each of the remaining corners, numbered 0, 1, and 2.\nThe square room has walls of length p and a laser ray from the southwest corner first meets the east wall at a distance q from the 0th receptor.\nGiven the two integers p and q, return the number of the receptor that the ray meets first.\nThe test cases are guaranteed so that the ray will meet a receptor eventually.\nExample 1:\nExample 2:\nConstraints:"
    },
    "missing-number": {
      "questionId": "268",
      "title": "Missing Number",
      "difficulty": "Easy",
      "constraints": [
        "n == nums.length",
        "1 <= n <= 104",
        "0 <= nums[i] <= n",
        "All the numbers of nums are unique."
      ],
      "description": "Given an array nums containing n distinct numbers in the range [0, n], return the only number in the range that is missing from the array.\nExample 1:\nExample 2:\nExample 3:\nConstraints:\nFollow up: Could you implement a solution using only O(1) extra space complexity and O(n) runtime complexity?"
    },
    "monotone-increasing-digits": {
      "questionId": "738",
      "title": "Monotone Increasing Digits",
      "difficulty": "Medium",
      "constraints": [
        "0 <= n <= 109"
      ],
      "description": "An integer has monotone increasing digits if and only if each pair of adjacent digits x and y satisfy x <= y.\nGiven an integer n, return the largest number that is less than or equal to n with monotone increasing digits.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "multiply-strings": {
      "questionId": "43",
      "title": "Multiply Strings",
      "difficulty": "Medium",
      "constraints": [
        "1 <= num1.length, num2.length <= 200",
        "num1 and num2 consist of digits only.",
        "Both num1 and num2 do not contain any leading zero, except the number 0 itself."
      ],
      "description": "Given two non-negative integers num1 and num2 represented as strings, return the product of num1 and num2, also represented as a string.\nNote: You must not use any built-in BigInteger library or convert the inputs to integer directly.\nExample 1:\nExample 2:\nConstraints:"
    },
    "new-21-game": {
      "questionId": "837",
      "title": "New 21 Game",
      "difficulty": "Medium",
      "constraints": [
        "0 <= k <= n <= 104",
        "1 <= maxPts <= 104"
      ],
      "description": "Alice plays the following game, loosely based on the card game \"21\".\nAlice starts with 0 points and draws numbers while she has less than k points. During each draw, she gains an integer number of points randomly from the range [1, maxPts], where maxPts is an integer. Each draw is independent and the outcomes have equal probabilities.\nAlice stops drawing numbers when she gets k or more points.\nReturn the probability that Alice has n or fewer points.\nAnswers within 10-5 of the actual answer are considered accepted.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "next-greater-element-iii": {
      "questionId": "556",
      "title": "Next Greater Element III",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 231 - 1"
      ],
      "description": "Given a positive integer n, find the smallest integer which has exactly the same digits existing in the integer n and is greater in value than n. If no such positive integer exists, return -1.\nNote that the returned integer should fit in 32-bit integer, if there is a valid answer but it does not fit in 32-bit integer, return -1.\nExample 1:\nExample 2:\nConstraints:"
    },
    "nim-game": {
      "questionId": "292",
      "title": "Nim Game",
      "difficulty": "Easy",
      "constraints": [
        "1 <= n <= 231 - 1"
      ],
      "description": "You are playing the following Nim Game with your friend:\nGiven n, the number of stones in the heap, return true if you can win the game assuming both you and your friend play optimally, otherwise return false.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "nth-digit": {
      "questionId": "400",
      "title": "Nth Digit",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 231 - 1"
      ],
      "description": "Given an integer n, return the nth digit of the infinite integer sequence [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, ...].\nExample 1:\nExample 2:\nConstraints:"
    },
    "number-of-boomerangs": {
      "questionId": "447",
      "title": "Number of Boomerangs",
      "difficulty": "Medium",
      "constraints": [
        "n == points.length",
        "1 <= n <= 500",
        "points[i].length == 2",
        "-104 <= xi, yi <= 104",
        "All the points are unique."
      ],
      "description": "You are given n points in the plane that are all distinct, where points[i] = [xi, yi]. A boomerang is a tuple of points (i, j, k) such that the distance between i and j equals the distance between i and k (the order of the tuple matters).\nReturn the number of boomerangs.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "smallest-range-ii": {
      "questionId": "910",
      "title": "Smallest Range II",
      "difficulty": "Medium",
      "constraints": [
        "1 <= nums.length <= 104",
        "0 <= nums[i] <= 104",
        "0 <= k <= 104"
      ],
      "description": "You are given an integer array nums and an integer k.\nFor each index i where 0 <= i < nums.length, change nums[i] to be either nums[i] + k or nums[i] - k.\nThe score of nums is the difference between the maximum and minimum elements in nums.\nReturn the minimum score of nums after changing the values at each index.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "solve-the-equation": {
      "questionId": "640",
      "title": "Solve the Equation",
      "difficulty": "Medium",
      "constraints": [
        "3 <= equation.length <= 1000",
        "equation has exactly one '='.",
        "equation consists of integers with an absolute value in the range [0, 100] without any leading zeros, and the variable 'x'.",
        "The input is generated that if there is a single solution, it will be an integer."
      ],
      "description": "Solve a given equation and return the value of 'x' in the form of a string \"x=#value\". The equation contains only '+', '-' operation, the variable 'x' and its coefficient. You should return \"No solution\" if there is no solution for the equation, or \"Infinite solutions\" if there are infinite solutions for the equation.\nIf there is exactly one solution for the equation, we ensure that the value of 'x' is an integer.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "soup-servings": {
      "questionId": "808",
      "title": "Soup Servings",
      "difficulty": "Medium",
      "constraints": [
        "0 <= n <= 109"
      ],
      "description": "You have two soups, A and B, each starting with n mL. On every turn, one of the following four serving operations is chosen at random, each with probability 0.25 independent of all previous turns:\nNote:\nThe process stops immediately after any turn in which one of the soups is used up.\nReturn the probability that A is used up before B, plus half the probability that both soups are used up in the same turn. Answers within 10-5 of the actual answer will be accepted.\nExample 1:\nExample 2:\nConstraints:"
    },
    "sqrtx": {
      "questionId": "69",
      "title": "Sqrt(x)",
      "difficulty": "Easy",
      "constraints": [
        "0 <= x <= 231 - 1"
      ],
      "description": "Given a non-negative integer x, return the square root of x rounded down to the nearest integer. The returned integer should be non-negative as well.\nYou must not use any built-in exponent function or operator.\nExample 1:\nExample 2:\nConstraints:"
    },
    "stone-game": {
      "questionId": "877",
      "title": "Stone Game",
      "difficulty": "Medium",
      "constraints": [
        "2 <= piles.length <= 500",
        "piles.length is even.",
        "1 <= piles[i] <= 500",
        "sum(piles[i]) is odd."
      ],
      "description": "Alice and Bob play a game with piles of stones. There are an even number of piles arranged in a row, and each pile has a positive integer number of stones piles[i].\nThe objective of the game is to end with the most stones. The total number of stones across all the piles is odd, so there are no ties.\nAlice and Bob take turns, with Alice starting first. Each turn, a player takes the entire pile of stones either from the beginning or from the end of the row. This continues until there are no more piles left, at which point the person with the most stones wins.\nAssuming Alice and Bob play optimally, return true if Alice wins the game, or false if Bob wins.\nExample 1:\nExample 2:\nConstraints:"
    },
    "sum-of-square-numbers": {
      "questionId": "633",
      "title": "Sum of Square Numbers",
      "difficulty": "Medium",
      "constraints": [
        "0 <= c <= 231 - 1"
      ],
      "description": "Given a non-negative integer c, decide whether there're two integers a and b such that a2 + b2 = c.\nExample 1:\nExample 2:\nConstraints:"
    },
    "sum-of-two-integers": {
      "questionId": "371",
      "title": "Sum of Two Integers",
      "difficulty": "Medium",
      "constraints": [
        "-1000 <= a, b <= 1000"
      ],
      "description": "Given two integers a and b, return the sum of the two integers without using the operators + and -.\nExample 1:\nExample 2:\nConstraints:"
    },
    "super-pow": {
      "questionId": "372",
      "title": "Super Pow",
      "difficulty": "Medium",
      "constraints": [
        "1 <= a <= 231 - 1",
        "1 <= b.length <= 2000",
        "0 <= b[i] <= 9",
        "b does not contain leading zeros."
      ],
      "description": "Your task is to calculate ab mod 1337 where a is a positive integer and b is an extremely large positive integer given in the form of an array.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "super-ugly-number": {
      "questionId": "313",
      "title": "Super Ugly Number",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 105",
        "1 <= primes.length <= 100",
        "2 <= primes[i] <= 1000",
        "primes[i] is guaranteed to be a prime number.",
        "All the values of primes are unique and sorted in ascending order."
      ],
      "description": "A super ugly number is a positive integer whose prime factors are in the array primes.\nGiven an integer n and an array of integers primes, return the nth super ugly number.\nThe nth super ugly number is guaranteed to fit in a 32-bit signed integer.\nExample 1:\nExample 2:\nConstraints:"
    },
    "surface-area-of-3d-shapes": {
      "questionId": "892",
      "title": "Surface Area of 3D Shapes",
      "difficulty": "Easy",
      "constraints": [
        "n == grid.length == grid[i].length",
        "1 <= n <= 50",
        "0 <= grid[i][j] <= 50"
      ],
      "description": "You are given an n x n grid where you have placed some 1 x 1 x 1 cubes. Each value v = grid[i][j] represents a tower of v cubes placed on top of cell (i, j).\nAfter placing these cubes, you have decided to glue any directly adjacent cubes to each other, forming several irregular 3D shapes.\nReturn the total surface area of the resulting shapes.\nNote: The bottom face of each shape counts toward its surface area.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "total-hamming-distance": {
      "questionId": "477",
      "title": "Total Hamming Distance",
      "difficulty": "Medium",
      "constraints": [
        "1 <= nums.length <= 104",
        "0 <= nums[i] <= 109",
        "The answer for the given input will fit in a 32-bit integer."
      ],
      "description": "The Hamming distance between two integers is the number of positions at which the corresponding bits are different.\nGiven an integer array nums, return the sum of Hamming distances between all the pairs of the integers in nums.\nExample 1:\nExample 2:\nConstraints:"
    },
    "ugly-number": {
      "questionId": "263",
      "title": "Ugly Number",
      "difficulty": "Easy",
      "constraints": [
        "-231 <= n <= 231 - 1"
      ],
      "description": "An ugly number is a positive integer which does not have a prime factor other than 2, 3, and 5.\nGiven an integer n, return true if n is an ugly number.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "ugly-number-ii": {
      "questionId": "264",
      "title": "Ugly Number II",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 1690"
      ],
      "description": "An ugly number is a positive integer whose prime factors are limited to 2, 3, and 5.\nGiven an integer n, return the nth ugly number.\nExample 1:\nExample 2:\nConstraints:"
    },
    "unique-binary-search-trees": {
      "questionId": "96",
      "title": "Unique Binary Search Trees",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 19"
      ],
      "description": "Given an integer n, return the number of structurally unique BST's (binary search trees) which has exactly n nodes of unique values from 1 to n.\nExample 1:\nExample 2:\nConstraints:"
    },
    "valid-perfect-square": {
      "questionId": "367",
      "title": "Valid Perfect Square",
      "difficulty": "Easy",
      "constraints": [
        "1 <= num <= 231 - 1"
      ],
      "description": "Given a positive integer num, return true if num is a perfect square or false otherwise.\nA perfect square is an integer that is the square of an integer. In other words, it is the product of some integer with itself.\nYou must not use any built-in library function, such as sqrt.\nExample 1:\nExample 2:\nConstraints:"
    },
    "valid-square": {
      "questionId": "593",
      "title": "Valid Square",
      "difficulty": "Medium",
      "constraints": [
        "p1.length == p2.length == p3.length == p4.length == 2",
        "-104 <= xi, yi <= 104"
      ],
      "description": "Given the coordinates of four points in 2D space p1, p2, p3 and p4, return true if the four points construct a square.\nThe coordinate of a point pi is represented as [xi, yi]. The input is not given in any order.\nA valid square has four equal sides with positive length and four equal angles (90-degree angles).\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "water-and-jug-problem": {
      "questionId": "365",
      "title": "Water and Jug Problem",
      "difficulty": "Medium",
      "constraints": [
        "1 <= x, y, target <= 103"
      ],
      "description": "You are given two jugs with capacities x liters and y liters. You have an infinite water supply. Return whether the total amount of water in both jugs may reach target using the following operations:\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "x-of-a-kind-in-a-deck-of-cards": {
      "questionId": "914",
      "title": "X of a Kind in a Deck of Cards",
      "difficulty": "Easy",
      "constraints": [
        "1 <= deck.length <= 104",
        "0 <= deck[i] < 104"
      ],
      "description": "You are given an integer array deck where deck[i] represents the number written on the ith card.\nPartition the cards into one or more groups such that:\nReturn true if such partition is possible, or false otherwise.\nExample 1:\nExample 2:\nConstraints:"
    },
    "optimal-division": {
      "questionId": "553",
      "title": "Optimal Division",
      "difficulty": "Medium",
      "constraints": [
        "1 <= nums.length <= 10",
        "2 <= nums[i] <= 1000",
        "There is only one optimal division for the given input."
      ],
      "description": "You are given an integer array nums. The adjacent integers in nums will perform the float division.\nHowever, you can add any number of parenthesis at any position to change the priority of operations. You want to add these parentheses such the value of the expression after the evaluation is maximum.\nReturn the corresponding expression that has the maximum value in string format.\nNote: your expression should not contain redundant parenthesis.\nExample 1:\nExample 2:\nConstraints:"
    },
    "palindrome-number": {
      "questionId": "9",
      "title": "Palindrome Number",
      "difficulty": "Easy",
      "constraints": [
        "-231 <= x <= 231 - 1"
      ],
      "description": "Given an integer x, return true if x is a palindrome, and false otherwise.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "perfect-number": {
      "questionId": "507",
      "title": "Perfect Number",
      "difficulty": "Easy",
      "constraints": [
        "1 <= num <= 108"
      ],
      "description": "A perfect number is a positive integer that is equal to the sum of its positive divisors, excluding the number itself. A divisor of an integer x is an integer that can divide x evenly.\nGiven an integer n, return true if n is a perfect number, otherwise return false.\nExample 1:\nExample 2:\nConstraints:"
    },
    "plus-one": {
      "questionId": "66",
      "title": "Plus One",
      "difficulty": "Easy",
      "constraints": [
        "1 <= digits.length <= 100",
        "0 <= digits[i] <= 9",
        "digits does not contain any leading 0's."
      ],
      "description": "You are given a large integer represented as an integer array digits, where each digits[i] is the ith digit of the integer. The digits are ordered from most significant to least significant in left-to-right order. The large integer does not contain any leading 0's.\nIncrement the large integer by one and return the resulting array of digits.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "power-of-four": {
      "questionId": "342",
      "title": "Power of Four",
      "difficulty": "Easy",
      "constraints": [
        "-231 <= n <= 231 - 1"
      ],
      "description": "Given an integer n, return true if it is a power of four. Otherwise, return false.\nAn integer n is a power of four, if there exists an integer x such that n == 4x.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "power-of-three": {
      "questionId": "326",
      "title": "Power of Three",
      "difficulty": "Easy",
      "constraints": [
        "-231 <= n <= 231 - 1"
      ],
      "description": "Given an integer n, return true if it is a power of three. Otherwise, return false.\nAn integer n is a power of three, if there exists an integer x such that n == 3x.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "power-of-two": {
      "questionId": "231",
      "title": "Power of Two",
      "difficulty": "Easy",
      "constraints": [
        "-231 <= n <= 231 - 1"
      ],
      "description": "Given an integer n, return true if it is a power of two. Otherwise, return false.\nAn integer n is a power of two, if there exists an integer x such that n == 2x.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "powerful-integers": {
      "questionId": "970",
      "title": "Powerful Integers",
      "difficulty": "Medium",
      "constraints": [
        "1 <= x, y <= 100",
        "0 <= bound <= 106"
      ],
      "description": "Given three integers x, y, and bound, return a list of all the powerful integers that have a value less than or equal to bound.\nAn integer is powerful if it can be represented as xi + yj for some integers i >= 0 and j >= 0.\nYou may return the answer in any order. In your answer, each value should occur at most once.\nExample 1:\nExample 2:\nConstraints:"
    },
    "powx-n": {
      "questionId": "50",
      "title": "Pow(x, n)",
      "difficulty": "Medium",
      "constraints": [
        "-100.0 < x < 100.0",
        "-231 <= n <= 231-1",
        "n is an integer.",
        "Either x is not zero or n > 0.",
        "-104 <= xn <= 104"
      ],
      "description": "Implement pow(x, n), which calculates x raised to the power n (i.e., xn).\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "predict-the-winner": {
      "questionId": "486",
      "title": "Predict the Winner",
      "difficulty": "Medium",
      "constraints": [
        "1 <= nums.length <= 20",
        "0 <= nums[i] <= 107"
      ],
      "description": "You are given an integer array nums. Two players are playing a game with this array: player 1 and player 2.\nPlayer 1 and player 2 take turns, with player 1 starting first. Both players start the game with a score of 0. At each turn, the player takes one of the numbers from either end of the array (i.e., nums[0] or nums[nums.length - 1]) which reduces the size of the array by 1. The player adds the chosen number to their score. The game ends when there are no more elements in the array.\nReturn true if Player 1 can win the game. If the scores of both players are equal, then player 1 is still the winner, and you should also return true. You may assume that both players are playing optimally.\nExample 1:\nExample 2:\nConstraints:"
    },
    "prime-number-of-set-bits-in-binary-representation": {
      "questionId": "762",
      "title": "Prime Number of Set Bits in Binary Representation",
      "difficulty": "Easy",
      "constraints": [
        "1 <= left <= right <= 106",
        "0 <= right - left <= 104"
      ],
      "description": "Given two integers left and right, return the count of numbers in the inclusive range [left, right] having a prime number of set bits in their binary representation.\nRecall that the number of set bits an integer has is the number of 1's present when written in binary.\nExample 1:\nExample 2:\nConstraints:"
    },
    "prime-palindrome": {
      "questionId": "866",
      "title": "Prime Palindrome",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 108"
      ],
      "description": "Given an integer n, return the smallest prime palindrome greater than or equal to n.\nAn integer is prime if it has exactly two divisors: 1 and itself. Note that 1 is not a prime number.\nAn integer is a palindrome if it reads the same from left to right as it does from right to left.\nThe test cases are generated so that the answer always exists and is in the range [2, 2 * 108].\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "prison-cells-after-n-days": {
      "questionId": "957",
      "title": "Prison Cells After N Days",
      "difficulty": "Medium",
      "constraints": [
        "cells.length == 8",
        "cells[i] is either 0 or 1.",
        "1 <= n <= 109"
      ],
      "description": "There are 8 prison cells in a row and each cell is either occupied or vacant.\nEach day, whether the cell is occupied or vacant changes according to the following rules:\nNote that because the prison is a row, the first and the last cells in the row can't have two adjacent neighbors.\nYou are given an integer array cells where cells[i] == 1 if the ith cell is occupied and cells[i] == 0 if the ith cell is vacant, and you are given an integer n.\nReturn the state of the prison after n days (i.e., n such changes described above).\nExample 1:\nExample 2:\nConstraints:"
    },
    "projection-area-of-3d-shapes": {
      "questionId": "883",
      "title": "Projection Area of 3D Shapes",
      "difficulty": "Easy",
      "constraints": [
        "n == grid.length == grid[i].length",
        "1 <= n <= 50",
        "0 <= grid[i][j] <= 50"
      ],
      "description": "You are given an n x n grid where we place some 1 x 1 x 1 cubes that are axis-aligned with the x, y, and z axes.\nEach value v = grid[i][j] represents a tower of v cubes placed on top of the cell (i, j).\nWe view the projection of these cubes onto the xy, yz, and zx planes.\nA projection is like a shadow, that maps our 3-dimensional figure to a 2-dimensional plane. We are viewing the \"shadow\" when looking at the cubes from the top, the front, and the side.\nReturn the total area of all three projections.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "rabbits-in-forest": {
      "questionId": "781",
      "title": "Rabbits in Forest",
      "difficulty": "Medium",
      "constraints": [
        "1 <= answers.length <= 1000",
        "0 <= answers[i] < 1000"
      ],
      "description": "There is a forest with an unknown number of rabbits. We asked n rabbits \"How many rabbits have the same color as you?\" and collected the answers in an integer array answers where answers[i] is the answer of the ith rabbit.\nGiven the array answers, return the minimum number of rabbits that could be in the forest.\nExample 1:\nExample 2:\nConstraints:"
    },
    "random-pick-index": {
      "questionId": "398",
      "title": "Random Pick Index",
      "difficulty": "Medium",
      "constraints": [
        "1 <= nums.length <= 2 * 104",
        "-231 <= nums[i] <= 231 - 1",
        "target is an integer from nums.",
        "At most 104 calls will be made to pick."
      ],
      "description": "Given an integer array nums with possible duplicates, randomly output the index of a given target number. You can assume that the given target number must exist in the array.\nImplement the Solution class:\nExample 1:\nConstraints:"
    },
    "random-pick-with-weight": {
      "questionId": "528",
      "title": "Random Pick with Weight",
      "difficulty": "Medium",
      "constraints": [
        "1 <= w.length <= 104",
        "1 <= w[i] <= 105",
        "pickIndex will be called at most 104 times."
      ],
      "description": "You are given a 0-indexed array of positive integers w where w[i] describes the weight of the ith index.\nYou need to implement the function pickIndex(), which randomly picks an index in the range [0, w.length - 1] (inclusive) and returns it. The probability of picking an index i is w[i] / sum(w).\nExample 1:\nExample 2:\nConstraints:"
    },
    "random-point-in-non-overlapping-rectangles": {
      "questionId": "497",
      "title": "Random Point in Non-overlapping Rectangles",
      "difficulty": "Medium",
      "constraints": [
        "1 <= rects.length <= 100",
        "rects[i].length == 4",
        "-109 <= ai < xi <= 109",
        "-109 <= bi < yi <= 109",
        "xi - ai <= 2000",
        "yi - bi <= 2000",
        "All the rectangles do not overlap.",
        "At most 104 calls will be made to pick."
      ],
      "description": "You are given an array of non-overlapping axis-aligned rectangles rects where rects[i] = [ai, bi, xi, yi] indicates that (ai, bi) is the bottom-left corner point of the ith rectangle and (xi, yi) is the top-right corner point of the ith rectangle. Design an algorithm to pick a random integer point inside the space covered by one of the given rectangles. A point on the perimeter of a rectangle is included in the space covered by the rectangle.\nAny integer point inside the space covered by one of the given rectangles should be equally likely to be returned.\nNote that an integer point is a point that has integer coordinates.\nImplement the Solution class:\nExample 1:\nConstraints:"
    },
    "range-addition-ii": {
      "questionId": "598",
      "title": "Range Addition II",
      "difficulty": "Easy",
      "constraints": [
        "1 <= m, n <= 4 * 104",
        "0 <= ops.length <= 104",
        "ops[i].length == 2",
        "1 <= ai <= m",
        "1 <= bi <= n"
      ],
      "description": "You are given an m x n matrix M initialized with all 0's and an array of operations ops, where ops[i] = [ai, bi] means M[x][y] should be incremented by one for all 0 <= x < ai and 0 <= y < bi.\nCount and return the number of maximum integers in the matrix after performing all the operations.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "reach-a-number": {
      "questionId": "754",
      "title": "Reach a Number",
      "difficulty": "Medium",
      "constraints": [
        "-109 <= target <= 109",
        "target != 0"
      ],
      "description": "You are standing at position 0 on an infinite number line. There is a destination at position target.\nYou can make some number of moves numMoves so that:\nGiven the integer target, return the minimum number of moves required (i.e., the minimum numMoves) to reach the destination.\nExample 1:\nExample 2:\nConstraints:"
    },
    "reconstruct-original-digits-from-english": {
      "questionId": "423",
      "title": "Reconstruct Original Digits from English",
      "difficulty": "Medium",
      "constraints": [
        "1 <= s.length <= 105",
        "s[i] is one of the characters [\"e\",\"g\",\"f\",\"i\",\"h\",\"o\",\"n\",\"s\",\"r\",\"u\",\"t\",\"w\",\"v\",\"x\",\"z\"].",
        "s is guaranteed to be valid."
      ],
      "description": "Given a string s containing an out-of-order English representation of digits 0-9, return the digits in ascending order.\nExample 1:\nExample 2:\nConstraints:"
    },
    "rectangle-area": {
      "questionId": "223",
      "title": "Rectangle Area",
      "difficulty": "Medium",
      "constraints": [
        "-104 <= ax1 <= ax2 <= 104",
        "-104 <= ay1 <= ay2 <= 104",
        "-104 <= bx1 <= bx2 <= 104",
        "-104 <= by1 <= by2 <= 104"
      ],
      "description": "Given the coordinates of two rectilinear rectangles in a 2D plane, return the total area covered by the two rectangles.\nThe first rectangle is defined by its bottom-left corner (ax1, ay1) and its top-right corner (ax2, ay2).\nThe second rectangle is defined by its bottom-left corner (bx1, by1) and its top-right corner (bx2, by2).\nExample 1:\nExample 2:\nConstraints:"
    },
    "rectangle-overlap": {
      "questionId": "836",
      "title": "Rectangle Overlap",
      "difficulty": "Easy",
      "constraints": [
        "rec1.length == 4",
        "rec2.length == 4",
        "-109 <= rec1[i], rec2[i] <= 109",
        "rec1 and rec2 represent a valid rectangle with a non-zero area."
      ],
      "description": "An axis-aligned rectangle is represented as a list [x1, y1, x2, y2], where (x1, y1) is the coordinate of its bottom-left corner, and (x2, y2) is the coordinate of its top-right corner. Its top and bottom edges are parallel to the X-axis, and its left and right edges are parallel to the Y-axis.\nTwo rectangles overlap if the area of their intersection is positive. To be clear, two rectangles that only touch at the corner or edges do not overlap.\nGiven two axis-aligned rectangles rec1 and rec2, return true if they overlap, otherwise return false.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "reordered-power-of-2": {
      "questionId": "869",
      "title": "Reordered Power of 2",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 109"
      ],
      "description": "You are given an integer n. We reorder the digits in any order (including the original order) such that the leading digit is not zero.\nReturn true if and only if we can do this so that the resulting number is a power of two.\nExample 1:\nExample 2:\nConstraints:"
    },
    "reverse-integer": {
      "questionId": "7",
      "title": "Reverse Integer",
      "difficulty": "Medium",
      "constraints": [
        "-231 <= x <= 231 - 1"
      ],
      "description": "Given a signed 32-bit integer x, return x with its digits reversed. If reversing x causes the value to go outside the signed 32-bit integer range [-231, 231 - 1], then return 0.\nAssume the environment does not allow you to store 64-bit integers (signed or unsigned).\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "roman-to-integer": {
      "questionId": "13",
      "title": "Roman to Integer",
      "difficulty": "Easy",
      "constraints": [
        "1 <= s.length <= 15",
        "s contains only the characters ('I', 'V', 'X', 'L', 'C', 'D', 'M').",
        "It is guaranteed that s is a valid roman numeral in the range [1, 3999]."
      ],
      "description": "Roman numerals are represented by seven different symbols: I, V, X, L, C, D and M.\nFor example, 2 is written as II in Roman numeral, just two ones added together. 12 is written as XII, which is simply X + II. The number 27 is written as XXVII, which is XX + V + II.\nRoman numerals are usually written largest to smallest from left to right. However, the numeral for four is not IIII. Instead, the number four is written as IV. Because the one is before the five we subtract it making four. The same principle applies to the number nine, which is written as IX. There are six instances where subtraction is used:\nGiven a roman numeral, convert it to an integer.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "rotate-function": {
      "questionId": "396",
      "title": "Rotate Function",
      "difficulty": "Medium",
      "constraints": [
        "n == nums.length",
        "1 <= n <= 105",
        "-100 <= nums[i] <= 100"
      ],
      "description": "You are given an integer array nums of length n.\nAssume arrk to be an array obtained by rotating nums by k positions clock-wise. We define the rotation function F on nums as follow:\nReturn the maximum value of F(0), F(1), ..., F(n-1).\nThe test cases are generated so that the answer fits in a 32-bit integer.\nExample 1:\nExample 2:\nConstraints:"
    },
    "rotated-digits": {
      "questionId": "788",
      "title": "Rotated Digits",
      "difficulty": "Medium",
      "constraints": [
        "1 <= n <= 104"
      ],
      "description": "An integer x is a good if after rotating each digit individually by 180 degrees, we get a valid number that is different from x. Each digit must be rotated - we cannot choose to leave it alone.\nA number is valid if each digit remains a digit after rotation. For example:\nGiven an integer n, return the number of good integers in the range [1, n].\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "self-dividing-numbers": {
      "questionId": "728",
      "title": "Self Dividing Numbers",
      "difficulty": "Easy",
      "constraints": [
        "1 <= left <= right <= 104"
      ],
      "description": "A self-dividing number is a number that is divisible by every digit it contains.\nA self-dividing number is not allowed to contain the digit zero.\nGiven two integers left and right, return a list of all the self-dividing numbers in the range [left, right] (both inclusive).\nExample 1:\nExample 2:\nConstraints:"
    },
    "shuffle-an-array": {
      "questionId": "384",
      "title": "Shuffle an Array",
      "difficulty": "Medium",
      "constraints": [
        "1 <= nums.length <= 50",
        "-106 <= nums[i] <= 106",
        "All the elements of nums are unique.",
        "At most 104 calls in total will be made to reset and shuffle."
      ],
      "description": "Given an integer array nums, design an algorithm to randomly shuffle the array. All permutations of the array should be equally likely as a result of the shuffling.\nImplement the Solution class:\nExample 1:\nConstraints:"
    },
    "smallest-integer-divisible-by-k": {
      "questionId": "1015",
      "title": "Smallest Integer Divisible by K",
      "difficulty": "Medium",
      "constraints": [
        "1 <= k <= 105"
      ],
      "description": "Given a positive integer k, you need to find the length of the smallest positive integer n such that n is divisible by k, and n only contains the digit 1.\nReturn the length of n. If there is no such n, return -1.\nNote: n may not fit in a 64-bit signed integer.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    },
    "smallest-range-i": {
      "questionId": "908",
      "title": "Smallest Range I",
      "difficulty": "Easy",
      "constraints": [
        "1 <= nums.length <= 104",
        "0 <= nums[i] <= 104",
        "0 <= k <= 104"
      ],
      "description": "You are given an integer array nums and an integer k.\nIn one operation, you can choose any index i where 0 <= i < nums.length and change nums[i] to nums[i] + x where x is an integer from the range [-k, k]. You can apply this operation at most once for each index i.\nThe score of nums is the difference between the maximum and minimum elements in nums.\nReturn the minimum score of nums after applying the mentioned operation at most once for each index in it.\nExample 1:\nExample 2:\nExample 3:\nConstraints:"
    }
  }
}